---
kind: property
id: P:Autodesk.Revit.DB.RepeatingReferenceSource.DimensionCount
source: html/3a27bf10-faac-de5e-7473-2a83be9e3d57.htm
---
# Autodesk.Revit.DB.RepeatingReferenceSource.DimensionCount Property

The dimension count of the repeating reference array.

## Syntax (C#)
```csharp
public int DimensionCount { get; }
```